Repository: raccoongang/openprocurement.auctions.lease.rg
Catalog: docs/source/locale/*/LC_MESSAGES/overview.po
Languages: uk

source: Overview
uk: Огляд

source: Conventions
uk: Домовленості

source: If something went wrong during the request, we'll get a different status code and the JSON returned will have an `errors` field at the top level containing a list of problems. We look at the first one and print out its message.
uk: Якщо під час запиту виникли труднощі, ми отримаємо інший код стану та JSON, який при поверненні міститиме `errors` поле на верхньому рівні зі списком проблем. Ми дивимось на першу з них і видруковуємо її повідомлення.

source: Main responsibilities
uk: Основні задачі

source: Business logic
uk: Бізнес логіка

source: Project status
uk: Стан проекту

source: The project has pre alpha status.
uk: Статус цього проекту - перед-альфа

source: The source repository for this project is on GitHub: https://github.com/openprocurement/openprocurement.auctions.dgf
uk: Репозиторій джерельних текстів цього проекту є на `GitHub <https://github.com/openprocurement/openprocurement.auctions.dgf>`_.

source: You can leave feedback by raising a new issue on the `issue tracker <https://github.com/openprocurement/openprocurement.auctions.dgf/issues>`_ (GitHub registration necessary).
uk: Повідомляйте про всі проблеми та поради через `issue tracker <https://github.com/openprocurement/openprocurement.auctions.dgf/issues>`_ (реєстрація на GitHub обов’язкова).

source: Documentation of related packages
uk: Документація пов’язаних пакетів

source: API stability
uk: Стабільність API

source: API is highly unstable, and while API endpoints are expected to remain relatively stable the data exchange formats are expected to be changed a lot. The changes in the API are communicated via `Open Procurement API <https://groups.google.com/group/open-procurement-api>`_ maillist.
uk: API є дуже нестабільним. Хоча точки входу API будуть відносно стабільними, формати обміну даними будуть часно змінюватись. Зміни в API обговорюються через `Open Procurement API <https://groups.google.com/group/open-procurement-api>`_ розсилку.

source: Change log
uk: Звіт про зміни

source: Released: not released
uk: Випущено: не випущено

source: Next steps
uk: Наступні кроки

source: openprocurement.auctions.dgf contains documentaion for Deposit Guarantee Fund auctions.
uk: openprocurement.auctions.dgf містить документацію по аукціонах Фонду гарантування вкладів.

source: Features
uk: Особливості

source: No need to specify enquiries period (there is no *active.enquiries* status), since it overlaps with *active.tendering* period.
uk: Відсутність необхідності вказання періоду уточнень (тут немає окремого статусу *active.enquiries*), оскільки він накладається на період прийому пропозицій *active.tendering*.

source: `tenderPeriod` must be at least 7 calendar days.
uk: `tenderPeriod` має складати щонайменше 7 календарних днів.

source: Organizer can edit procedure only during *rectificationPeriod*.
uk: Організатор може редагувати аукціон тільки впродовж *rectificationPeriod*.

source: Organizer can add and edit documents only during *rectificationPeriod*.
uk: Організатор може додавати та редагувати документи аукціону тільки впродовж *rectificationPeriod*.

source: Optionally Organizer can set *enquiryPeriod.endDate*.
uk: Також додатково Організатор має можливість встановити *enquiryPeriod.endDate*.

source: As soon as the action is edited, the status of all of the submitted bids will be switched to `invalid`.
uk: Кожного разу після редагування аукціону статус всіх ставок перемикається на `invalid`.

source: If *enquiryPeriod.endDate* is not provided it will be calculated automatically.
uk: Якщо *enquiryPeriod.endDate* не передано, ця дата встановлюється автоматично.

source: Procedure can be switched from *draft* status to *active.tendering*.
uk: Процедура переходить зі статусу *draft* до *active.tendering*.

source: During *active.tendering* period participants can ask questions, submit proposals, and upload documents.
uk: Протягом періоду *active.tendering* учасники можуть задавати питання, подавати пропозиції, завантажувати документи.

source: There is obligatory participant qualification (*Bid.selfQualified*) via guarantee payment.
uk: Обов’язкова кваліфікація учасника (*Bid.selfQualified*) через гарантійний платіж.

source: You might find it helpful to look at the :ref:`tutorial`.
uk: Можливо вам буде цікаво прочитати :ref:`tutorial`.

source: All API POST and PUT requests expect a top-level object with a single element in it named `data`. Successful responses will mirror this format. The data element should itself be an object, containing the parameters for the request. In the case of creating a new auction, these are the fields we want to set on the auction itself.
uk: Всі API POST та PUT запити очікують об'єкт верхнього рівня з єдиним елементом з назвою `data`. Відповіді з повідомленням про успіх будуть віддзеркалювати цей формат. Елемент data повинен сам бути об’єктом, що містить параметри запиту. Якщо створюється новий аукціон, то це ті поля, які ми хочемо встановити на самому аукціоні.

source: If the request was successful, we will get a response code of `201` indicating the object was created. That response will have a data field at its top level, which will contain complete information on the new auction, including its ID.
uk: Якщо запит був успішним, ми отримаємо код відповіді `201`, який вказує, що об’єкт був створений. Ця відповідь буде мати data поле на верхньому рівні, яке вміщуватиме повну інформацію про новий аукціон, включно з ID.

source: Organizer can both increase and decrease `value.amount`, `guarantee.amount`, `minimalStep.amount`.
uk: Організатор може як зменшувати, так і збільшувати `value.amount`, `guarantee.amount`, `minimalStep.amount`.

source: Organizer can't edit procedure's significant properties (*Auction.value*, etc.).
uk: Організатор не може редагувати суттєвих властивостей процедури, наприклад, *Auction.value*.

source: The only date Organizer has to provide is *Tender.auctionPeriod.startDate*, the rest will be calculated automatically.
uk: Організатор може передати тільки дату початку аукціону *Tender.auctionPeriod.startDate*. Всі решта дати будуть обраховані на її основі.

source: The only currency (*Value.currency*) for this procedure is hryvnia (UAH).
uk: Єдина валюта (*Value.currency*) цієї процедури - гривня UAH.

source: API accepts `JSON <http://json.org/>`_ or form-encoded content in requests. It returns JSON content in all of its responses, including errors. Only the UTF-8 character encoding is supported for both requests and responses.
uk: API приймає `JSON <http://json.org/>`_ або form-encoded вміст у запитах. Він повертає JSON вміст у всіх свої відповідях, включно з помилками. Підтримується лише UTF-8 кодування і для запитів, і для відповідей.

source: There are two procedures:
uk: Є дві процедури:

source: dgfOtherAssets - sale of the insolvent bank property.
uk: dgfOtherAssets - продаж майна банків, що ліквідуються.

source: dgfFinancialAssets - sale of the creditor claim right.
uk: dgfFinancialAssets - продаж права вимоги за кредитними договорами.

source: The items within an auction are allowed to be from different CAV groups.
uk: Аукціон може містити елементи з різних CAV груп.
